 gcc -g p1final.c
 ./a.out
Enter the two fractions
1
2
3
4
The sum of 1/2 + 3/4 is 10/8 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x856: file p1final.c, line 17.
(gdb) r
Starting program: /home/runner/Test3Session2-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:17
17  {
(gdb) n
19    input(&a,&b,&c,&d);
(gdb) s
input (num1=0x7ffdd71dc140, den1=0x7ffdd71dc144, num2=0x7ffdd71dc148, 
    den2=0x7ffdd71dc14c) at p1final.c:4
4     printf("Enter the two fractions\n");
(gdb) n
Enter the two fractions
5     scanf("%d%d %d%d",num1,den1,num2,den2);
(gdb) n
1
2
3
4
6   }
(gdb) n
main () at p1final.c:20
20    add(a,b,c,d,&x,&y);
(gdb) p a
$1 = 1
(gdb) p b
$2 = 2
(gdb) p c
$3 = 3
(gdb) p d
$4 = 4
(gdb) s
add (num1=1, den1=2, num2=3, den2=4, num3=0x7ffdd71dc150, den3=0x7ffdd71dc154)
    at p1final.c:9
9     *den3=den1*den2;
(gdb) n
10    *num3=(num1*den2)+(num2*den1);
(gdb) n
11  }
(gdb) n
main () at p1final.c:21
21    output(a,b,c,d,x,y);
(gdb) s
output (num1=1, den1=2, num2=3, den2=4, num3=10, den3=8) at p1final.c:14
14    printf("The sum of %d/%d + %d/%d is %d/%d",num1,den1,num2,den2,num3,den3);
(gdb) n
15  }
(gdb) n
main () at p1final.c:22
22    return 0;
(gdb) p x
$5 = 10
(gdb) p y
$6 = 8
(gdb) n
23  }(gdb) q
A debugging session is active.

    Inferior 1 [process 1071] will be killed.

Quit anyway? (y or n) y
